//"use strict";
var Constants = {};

/**
 * 用来定义小数位长度的数组 配合Math.round使用，如保留2位小数: Math.round(val*SYS_NUM_LEN[2])/SYS_NUM_LEN[2] val: 要转换的数字
 */
Constants.SYS_NUM_LEN = [1, 10, 100, 1000, 10000, 100000, 1000000, 10000000, 100000000, 1000000000];

/**
 * 数字/货币转大写的最大极限
 */
Constants.TO_CHINESE_MAX = 10000000000000000;

/**
 * 数字/货币转大写的最小极限
 */
Constants.TO_CHINESE_MIN = -10000000000000000;

/**
 * 日期格式
 */
Constants.DATE_FORMAT_VALUE = ['0', '0', '0', '0', '-', '0', '1', '-', '0', '1', ' ', '0', '0', ':', '0', '0', ':', '0', '0'];

/**
 * 在放一周的中文名数组
 */
Constants.WEEKARRAY = ['', '星期一', '星期二', '星期三', '星期四', '星期五', '星期六', '星期日'];

/**
 * 匹配到年的日期正则表达式
 */
Constants.DATE_PATTERN_YEAR = /^(\d{4})(年){0,1}$/;

/**
 * 匹配到月的日期正则表达式
 */
Constants.DATE_PATTERN_MONTH = /^(\d{4})(\/|-|\s|年){0,1}(0?[1-9]|1[0-2])(月){0,1}$/;

/**
 * 匹配到天的日期正则表达式
 */
Constants.DATE_PATTERN_DAY = /^(?:(?!0000)[0-9]{4}[-/.年]{0,1}(?:(?:0[1-9]|1[0-2])[-/.月]{0,1}(?:0[1-9]|1[0-9]|2[0-8])|(?:0[13-9]|1[0-2])[-/.月]{0,1}(?:29|30)|(?:0[13578]|1[02])[-/.月]{0,1}31)|(?:[0-9]{2}(?:0[48]|[2468][048]|[13579][26])|(?:0[48]|[2468][048]|[13579][26])00)[-/.年]{0,1}02[-/.月]{0,1}29)(\s|日){0,1}$/;
/**
 * 匹配到时的日期正则表达式
 */
Constants.DATE_PATTERN_HOUR = /^(?:(?!0000)[0-9]{4}[-/.年]{0,1}(?:(?:0[1-9]|1[0-2])[-/.月]{0,1}(?:0[1-9]|1[0-9]|2[0-8])|(?:0[13-9]|1[0-2])[-/.月]{0,1}(?:29|30)|(?:0[13578]|1[02])[-/.月]{0,1}31)|(?:[0-9]{2}(?:0[48]|[2468][048]|[13579][26])|(?:0[48]|[2468][048]|[13579][26])00)[-/.年]{0,1}02[-/.月]{0,1}29)(\s|日){0,1}([01][0-9]|2[0-3])(:|时){0,1}$/;

/**
 * 匹配到分的日期正则表达式
 */
Constants.DATE_PATTERN_MINUTE = /^(?:(?!0000)[0-9]{4}[-/.年]{0,1}(?:(?:0[1-9]|1[0-2])[-/.月]{0,1}(?:0[1-9]|1[0-9]|2[0-8])|(?:0[13-9]|1[0-2])[-/.月]{0,1}(?:29|30)|(?:0[13578]|1[02])[-/.月]{0,1}31)|(?:[0-9]{2}(?:0[48]|[2468][048]|[13579][26])|(?:0[48]|[2468][048]|[13579][26])00)[-/.年]{0,1}02[-/.月]{0,1}29)(\s|日){0,1}([01][0-9]|2[0-3])(:|时){0,1}[0-5][0-9](:|分){0,1}$/;

/**
 * 匹配到秒的日期正则表达式
 */
Constants.DATE_PATTERN_SECOND = /^(?:(?!0000)[0-9]{4}[-/.年]{0,1}(?:(?:0[1-9]|1[0-2])[-/.月]{0,1}(?:0[1-9]|1[0-9]|2[0-8])|(?:0[13-9]|1[0-2])[-/.月]{0,1}(?:29|30)|(?:0[13578]|1[02])[-/.月]{0,1}31)|(?:[0-9]{2}(?:0[48]|[2468][048]|[13579][26])|(?:0[48]|[2468][048]|[13579][26])00)[-/.年]{0,1}02[-/.月]{0,1}29)(\s|日){0,1}([01][0-9]|2[0-3])(:|时){0,1}[0-5][0-9](:|分){0,1}[0-5][0-9](秒){0,1}$/;

/**
 * 匹配到毫秒的日期正则表达式
 */
Constants.DATE_PATTERN_MILLISECOND = /^(?:(?!0000)[0-9]{4}[-/.年]{0,1}(?:(?:0[1-9]|1[0-2])[-/.月]{0,1}(?:0[1-9]|1[0-9]|2[0-8])|(?:0[13-9]|1[0-2])[-/.月]{0,1}(?:29|30)|(?:0[13578]|1[02])[-/.月]{0,1}31)|(?:[0-9]{2}(?:0[48]|[2468][048]|[13579][26])|(?:0[48]|[2468][048]|[13579][26])00)[-/.年]{0,1}02[-/.月]{0,1}29)(\s|日){0,1}([01][0-9]|2[0-3])(:|时){0,1}[0-5][0-9](:|分){0,1}[0-5][0-9](秒){0,1}(\.\d+)$/

/**
 * 匹配左右空格
 */
Constants.REGEXP_EMPTY = /(^\s*)|(\s*$)/g;

/**
 * 匹配邮箱
 */
Constants.REGEXP_EMAIL = /^(?:[a-z\d]+[_\-\+\.]?)*[a-z\d]+@(?:([a-z\d]+\-?)*[a-z\d]+\.)+([a-z]{2,})+$/i;

/**
 * 匹配身份证15位
 */
Constants.REGEXP_IDCARD_15 = /^(\d{6})(\d{2})(\d{2})(\d{2})(\d{3})$/;

/**
 * 匹配身份证18位
 */
Constants.REGEXP_IDCARD_18 = /^(\d{6})(\d{4})(\d{2})(\d{2})(\d{3})(\d|x|X)$/;

/**
 * 匹配邮编
 */
Constants.REGEXP_ZIP_CODE = /^[1-9]{1}(\d){5}$/;

/**
 * 匹配电话号码
 */
Constants.REGEXP_TEL = /^[+]{0,1}(\d){1,3}[ ]?([-]?((\d)|[ ]){1,12})+$/;

/**
 * 正整数(包含零)
 */
Constants.REGEXP_INTEGER = /^[+]{0,1}(\d+)$/;

/**
 * 正整数(不包含零)
 */
Constants.REGEXP_INTEGERNOZERO = /^[0-9]*[1-9][0-9]*$/;

/**
 * 匹配手机号码
 */
Constants.REGEXP_MOBILE = /^[1][3|4|5|6|7|8][0-9]{9}$/;

/**
 * 匹配子表中的预警提示或计算公式
 */
Constants.REGEXP_TAB = /\$\.getVal\((.+?)\)/g;

Constants.REGEXP_SUB_TAB = /\$\.getVal\('([^\.']+)\.([^\.']+)'\)/g;

Constants.ISIE = !-[1,];

/**
 * 数据类型
 */
var PublicDataType = {
    // 字符TRUE
    TRUE: 'true',

    // 字符FALSE
    FALSE: 'false',

    // 空对象
    NULL: null,

    // 字符串null
    STRING_NULL: 'null',

    // 空字符串
    STRING_EMPTY: '',

    // 空格
    SPACE: ' ',

    // 点号
    POINT: '.',

    // 百分符
    PERCENT: '%',

    // 逗号,千分位
    COMMA: ',',

    // 下划线
    UNDERLINE: '_',

    // 减号、中杠线
    MINUS: '-',

    // 加号、连接符
    PLUS: '+',

    // 钱
    MONEY: 'M',

    // 百分数
    PERCENTAGE: 'P',

    // 流水号
    FLOWCODE: 'F',

    // 数字
    NUMBER: ['N', 'number'],

    // 布尔
    BOOLEAN: ['B', 'boolean'],

    // 字符
    CHAR: ['C', 'char'],

    // 字符串
    STRING: ['S', 'string'],

    // 日期框
    DATE: ['D', 'date'],

    // Undefined
    UNDEFINED: ['U', 'undefined'],

    // function
    FUNCTION: ['F', 'function'],

    // 对象
    OBJECT: ['O', 'object']
};